### Basic Example
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.basic.data.aws_region.current: Reading...
module.basic.data.aws_region.current: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.basic.aws_eip.nat_gateway_eip[0] will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"           = "ABC-dev-nat-eip-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc                  = (known after apply)
    }

  # module.basic.aws_eip.nat_gateway_eip[1] will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"           = "ABC-dev-nat-eip-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc                  = (known after apply)
    }

  # module.basic.aws_eip.nat_gateway_eip[2] will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"           = "ABC-dev-nat-eip-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc                  = (known after apply)
    }

  # module.basic.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"           = "ABC-dev"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id   = (known after apply)
    }

  # module.basic.aws_nat_gateway.nat_gateway[0] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"           = "ABC-dev-natGateway-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
    }

  # module.basic.aws_nat_gateway.nat_gateway[1] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"           = "ABC-dev-natGateway-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
    }

  # module.basic.aws_nat_gateway.nat_gateway[2] will be created
  + resource "aws_nat_gateway" "nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"           = "ABC-dev-natGateway-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
    }

  # module.basic.aws_route_table.main will be created
  + resource "aws_route_table" "main" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"           = "ABC-dev-Public"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id           = (known after apply)
    }

  # module.basic.aws_route_table.nat_gateway_rt[0] will be created
  + resource "aws_route_table" "nat_gateway_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"           = "ABC-dev-natGateway-rt-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id           = (known after apply)
    }

  # module.basic.aws_route_table.nat_gateway_rt[1] will be created
  + resource "aws_route_table" "nat_gateway_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"           = "ABC-dev-natGateway-rt-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id           = (known after apply)
    }

  # module.basic.aws_route_table.nat_gateway_rt[2] will be created
  + resource "aws_route_table" "nat_gateway_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"           = "ABC-dev-natGateway-rt-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id           = (known after apply)
    }

  # module.basic.aws_route_table_association.internet_access[0] will be created
  + resource "aws_route_table_association" "internet_access" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.basic.aws_route_table_association.internet_access[1] will be created
  + resource "aws_route_table_association" "internet_access" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.basic.aws_route_table_association.internet_access[2] will be created
  + resource "aws_route_table_association" "internet_access" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.basic.aws_route_table_association.nat_gateway_rt_association[0] will be created
  + resource "aws_route_table_association" "nat_gateway_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.basic.aws_route_table_association.nat_gateway_rt_association[1] will be created
  + resource "aws_route_table_association" "nat_gateway_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.basic.aws_route_table_association.nat_gateway_rt_association[2] will be created
  + resource "aws_route_table_association" "nat_gateway_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.basic.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.8.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-private-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-private-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.16.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-private-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-private-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.private_subnet[2] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.24.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-private-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-private-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.private_subnet_with_nat[0] will be created
  + resource "aws_subnet" "private_subnet_with_nat" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.104.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-private-with-nat-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-private-with-nat-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.private_subnet_with_nat[1] will be created
  + resource "aws_subnet" "private_subnet_with_nat" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.112.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-private-with-nat-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-private-with-nat-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.private_subnet_with_nat[2] will be created
  + resource "aws_subnet" "private_subnet_with_nat" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.120.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-private-with-nat-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-private-with-nat-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.208.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-public-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-public-0"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.216.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-public-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-public-1"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.224.0/21"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"           = "ABC-dev-public-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                        = {
          + "Name"           = "ABC-dev-public-2"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + vpc_id                          = (known after apply)
    }

  # module.basic.aws_vpc.custom_vpc will be created
  + resource "aws_vpc" "custom_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"           = "ABC-dev"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
      + tags_all                         = {
          + "Name"           = "ABC-dev"
          + "business_unit"  = "XYZ"
          + "environment"    = "dev"
          + "managed_by"     = "Terraform"
          + "project"        = "ABC"
          + "provisioned_by" = "pankaj.narang@outlook.com"
          + "team"           = "Engineering"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pankajnarang, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*